# Functions of pandas

In [6]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[99,89,99,87,99,87,82],
               }
df=pd.DataFrame(dict1,index=['stu1','stu2','stu3','stu4','stu5',
                             'stu6','stu7'])
df

         Name  Marks
stu1  Priyang     99
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     99
stu6   Mittal     87
stu7  Archana     82

In [3]:
df.shape

(7, 2)

In [5]:
df.head(5)

         Name  Marks
stu1  Priyang     99
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     99

In [7]:
df.tail(5)

         Name  Marks
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     99
stu6   Mittal     87
stu7  Archana     82

In [9]:
df.columns

Index(['Name', 'Marks'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [12]:
df['Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [15]:
df[['Name','Marks']]

         Name  Marks
stu1  Priyang     99
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     99
stu6   Mittal     87
stu7  Archana     82

In [25]:
df[1:7]

         Name  Marks
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     99
stu6   Mittal     87
stu7  Archana     82

In [18]:
df.iloc[0]

Name     Priyang
Marks         99
Name: stu1, dtype: object

In [19]:
df.describe()

           Marks
count   7.000000
mean   91.714286
std     7.134757
min    82.000000
25%    87.000000
50%    89.000000
75%    99.000000
max    99.000000

In [20]:
df['Marks'].value_counts()

Marks
99    3
87    2
89    1
82    1
Name: count, dtype: int64

In [21]:
df['Marks'].count()

7

In [22]:
df['Marks'].max()

99

In [23]:
df['Marks'].min()

82

In [24]:
df['Marks'].mean()

91.71428571428571